Encoding hierarchical codes for classification tasks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-09 nie 13:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Encoding hierarchical codes for classification tasks</title>
<meta name="generator" content="Org mode" />
<meta name="keywords" content="machine learning, encoder" />
<link rel="stylesheet" type="text/css" href="./static/main.css" />
</head>
<body>
<div id="preamble" class="status">
      <header class="masthead">
        <h1 class="masthead-title">For more humane computing</h1>
        <ul>
          <li><a href="index.html">Blog</a></li>
          <li><a href="http://github.com/sirherrbatka">GitHub</a></li>
        </ul>
      </header>
</div>
<div id="content">
<h1 class="title">Encoding hierarchical codes for classification tasks</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9fb1b73">Why I even care about all of this?</a></li>
<li><a href="#org3320803">The dilema.</a></li>
<li><a href="#orgaec39be">Devil in the details.</a></li>
<li><a href="#orgd96ace9">The promised solution.</a></li>
<li><a href="#orgd077c74">Not always plain and simple&#x2026;</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9fb1b73" class="outline-2">
<h2 id="org9fb1b73">Why I even care about all of this?</h2>
<div class="outline-text-2" id="text-org9fb1b73">
<p>
ICD10 codes are hierarchical, ubiquitous, and precise. However, partly because they are so precise, there are also numerous. Sheer count of different codes encountered in data sets presents a challenge when building machine learning models: one can either use complete codes or truncate those to obtain groups. Using a complete code (in the one-hot schema) sacrifices generalization potential. Is it critical to distinguish between the left and right leg? Likely not. But in the particular case of the ICD10, code truncation may lead to not immediately apparent issues.
</p>
</div>
</div>
<div id="outline-container-org3320803" class="outline-2">
<h2 id="org3320803">The dilema.</h2>
<div class="outline-text-2" id="text-org3320803">
<p>
Consider A52- prefix. It is for late syphilis. What does it mean? A diverse set of disease progress pathways. It is not about trivial differences anymore. The relative code importance (more on that later) is usually poorly correlated with the hierarchical position. Furthermore, it is often the case for one of the sibling codes to occur much more frequently than the others. Code truncation may lead your machine learning model to effectively assume that the prefix is always the result of a highly dominant code truncation.
</p>
</div>
</div>
<div id="outline-container-orgaec39be" class="outline-2">
<h2 id="orgaec39be">Devil in the details.</h2>
<div class="outline-text-2" id="text-orgaec39be">
<p>
In the medical domain, I expect mild clinical cases outnumbering complicated ones. Keep in mind that the cost of underestimating medical conditions is grave, so this is a recipe for disaster in treatment. The imbalance of codes within a prefix group is not limited to the medical domain. I urge you to investigate the practical applications of your machine learning models. You may find very similar problems remote to the clinical datasets.
</p>
</div>
</div>
<div id="outline-container-orgd96ace9" class="outline-2">
<h2 id="orgd96ace9">The promised solution.</h2>
<div class="outline-text-2" id="text-orgd96ace9">
<p>
So, anyway, how do I approach ICD10 encoding? Let me start with a small disclaimer: I have the luxury of having a reliable metric of the code significance readmission rate of the patients with a given code. Using this value, I could order a list of complete codes within a prefix from the least to the most threatening. Secondly, I calculate the frequency for each code within the prefix group. Thirdly I calculate the cumulant frequency of code within a group, ordered by the readmission rate; ascending. I assign a numeric index to each group to obtain features. If I would place 1 as a feature if a group is present within a record, and 0 if not, I would have ended up with a classical one-hot encoder. I will instead place the maximum cumulant frequency among assigned diagnoses as a group feature value.
</p>

<p>
And voila, this is how I've invented a simple (but effective) diagnosis encoder. It is easy to implement and still allows to obtain feature importance from the random forest. A solid improvement overall, bridging the best of both worlds.
</p>

<p>
This schema ensures that each feature group will present the direst diagnosis. Furthermore, it also forms a similarity heuristic. If two diagnoses within a prefix share a similar readmission rate and the number of cases, they are often ontologically close to each other. This trait benefits the generalization potential of the model.
</p>
</div>
</div>
<div id="outline-container-orgd077c74" class="outline-2">
<h2 id="orgd077c74">Not always plain and simple&#x2026;</h2>
<div class="outline-text-2" id="text-orgd077c74">
<p>
I called the readmission rate a "luxury" because It is rare to have a severity metric. When lacking severity metrics, you could try to order according to the frequency or become inventive and figure out something new. Perhaps try to obtain feature importance for the complete codes first? I've not tried it myself, but it could be a promising avenue for you to explore.
</p>
</div>
</div>
</div>
</body>
</html>
